placeholder/dbl_0_58_89_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       12722;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       12732;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          446;
        startFace       12742;
    }
    baffle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          98;
        startFace       13188;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6502;
        startFace       13286;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6502;
        startFace       19788;
    }
)

// ************************************************************************* //
